app/Controllers/Admins/AdminsController.php

SELECT COUNT(*) AS `numrows`
FROM `properties`
SELECT COUNT(*) AS `numrows`
FROM `hometypes`
SELECT COUNT(*) AS `numrows`
FROM `admins`
---
    public function index(){
        $session = session();

        $propsCount = $this->db->table('properties')
        ->countAllResults();

        $homeTypeCount = $this->db->table('hometypes')
        ->countAllResults();

        $adminsCount = $this->db->table('admins')
        ->countAllResults();

SELECT *
FROM `admins`
---
    public function displayAdmins(){
        $session = session();
        $admin = new Admin();

        $allAdmins = $admin->findAll();

INSERT INTO `admins` (`name`, `email`, `password`) VALUES ('admin2', 'admin2@email.com', '$2y$10$0.RS7W3/ZGz009MP0aVZiOyHjj/CKeo9bV/qg2pJYj7t3DdLHXTbe')
---
    public function storeAdmin(){

        $session = session();
        $inputs = $this->validate([
            'name' => 'required|min_length[5]',
            'email' => 'required|valid_email',
            'password' => 'required|min_length[5]|alpha_numeric',

        ]);

        if (!$inputs) {
            return view('admins/create', [
                'validation' => $this->validator,
                'session' => $session
            ]);
        }else{
            $admin = new Admin();

            $data = [
                "name" =>  $this->request->getPost('name'),
                "email" =>  $this->request->getPost('email'),
                "password" =>  password_hash($this->request->getPost('password'), PASSWORD_DEFAULT)
            ];

            $admin->save($data);

SELECT *
FROM `hometypes`
---
    public function displayHomeTypes(){
        $session = session();
        $homeTypes = new HomeType();

        $allHomeType = $homeTypes->findAll();